app/Http/Controllers/NewWordController.php

insert into `new_words` (`norwegian`, `sami`, `updated_at`, `created_at`) values ('1223', '553', '2021-08-24 07:43:42', '2021-08-24 07:43:42')
---
    public function store(NewWordRequest $request)
    {
        $body = json_decode($request->getContent());

        $word = NewWord::firstOrCreate([
            'norwegian' => $body->norwegian,
            'sami' => $body->sami,
        ]);