app/Models/LocalSearch.php

    public function words(SearchRequest $request)
    {
        $currentPage = $request->input('page');
        Paginator::currentPageResolver(function () use ($currentPage) {
            return $currentPage;
        });

        if ($currentPage == 1) {
            $query1 = DB::table('ord_norsk_samisk_BACKUP')
            ->where('fra', $request->input('search'))
            ->whereIn('kredittering', $request->input('dicts'))
            ->get();
---
select * from `ord_norsk_samisk_BACKUP` where (`fra` = 'mfdmls') and `kredittering` in ('A. Kintel 2013', 'Sáme Giellagálldo 2013', 'Medisijnalasj báhkogirjje')