app/Models/Statistic.php

select * from `statistics` where `date` in ('2021/08/23', '2021/08/24', '2021/08/25', '2021/08/26', '2021/08/27', '2021/08/28', '2021/08/29')
---
    public function getWeekly()
    {
        $dates = $this->getDatesInWeek((new DateTime(date('Y/m/d')))->format('W'));
        $data = $this::whereIn('date', $dates)->get();

select * from `statistics` where `date` between '2021-08-01' and '2021-08-31'
---
    public function getMonthly()
    {
        return $this::whereBetween('date', [date('Y-m-01'), date('Y-m-t')])->get();

select * from `statistics` where `date` between '2021-1-01' and '2021-1-31'
---
    public function getYearly()
    {
        $data = [];
        for ($i = 1; $i < 13; $i++) {
            $monthly = $this::whereBetween('date', [date("Y-$i-01"), date("Y-$i-t")])->get();